# Viewport Get Position At View Anchor Method

Source: https://www.revitapidocs.com/2026/e5c279a1-b4e1-4bb2-6e62-2ba971bb16ae.htm

---

| Viewport Get Position At View Anchor Method |
| --- |

Gets the position coordinates at the ViewAnchor.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public XYZ GetPositionAtViewAnchor(
	ViewAnchor viewAnchor
)
```

```
Public Function GetPositionAtViewAnchor (
	viewAnchor As ViewAnchor
) As XYZ
```

```
public:
XYZ^ GetPositionAtViewAnchor(
	ViewAnchor viewAnchor
)
```

```
member GetPositionAtViewAnchor :
        viewAnchor : ViewAnchor -> XYZ
```

#### Parameters

viewAnchor ViewAnchor
:   The viewAnchor at which the position is requested.

#### Return Value

XYZ
The position at the ViewAnchor. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The given value of viewAnchor cannot be applied to this Viewport. |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

Viewport Class Autodesk.Revit.DB Namespace